---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.RebarShapeConstraintChordLength
source: html/ba757c2f-1d01-9f36-ecdc-98ff54923374.htm
---
# RebarShapeConstraintChordLength Members

Create a constraint to drive chord length.